large docs restructuring and cleanup. working on protocol crate build errors
